app/controllers/articles_controller.rb

  def index
    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def show
    puts(session[:user_id])
    @article = Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create

    puts("userid ",session[:user_id])
    @user = User.find(session[:user_id])

    @article = @user.articles.create(article_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "articles" ("title", "text", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "new article"], ["text", "this is a new article"], ["user_id", 4], ["created_at", "2019-12-21 20:30:25.007088"], ["updated_at", "2019-12-21 20:30:25.007088"]]