app/controllers/comments_controller.rb

SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 3 LIMIT 1
SELECT  `comments`.* FROM `comments` WHERE `comments`.`article_id` = 3 AND `comments`.`id` = 3 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 3
DELETE FROM `comments` WHERE `comments`.`id` = 3
---
  def destroy
    puts("destroying comment")
    @article = Article.find(params[:article_id])
    puts("article", @article)
    @comment = @article.comments.find(params[:id])
      puts("comment", @comment)
    @comment.destroy