app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("username", "passowrd", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "bhagvan"], ["passowrd", "check1234"], ["created_at", "2019-12-21 20:12:48.570384"], ["updated_at", "2019-12-21 20:12:48.570384"]]