app/controllers/welcome_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "bhagvanarch@gmail.com"], ["LIMIT", 1]]
---
  def login
    puts("login")

    @user = User.find_by_username(params[:username])